# 판다스 익숙해지기 예제 100문제

## 01 Getting & Knowing Data

### 250610

In [ ]:
import pandas as pd

In [ ]:
dir(pd)

In [ ]:
# 1. 데이터 불러오기
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/lol.csv', sep='\t')

In [ ]:
# 2. 데이터 상위 n개 출력
df.head(5)

In [ ]:
# 3. 데이터 행과 열 갯수 파악
print(df.shape)
print('행:', df.shape[0])
print('열:', df.shape[1])

In [ ]:
# 4. 전체 컬럼 출력
Ans = df.columns
Ans

In [ ]:
# 5. 6번째 컬럼명 출력
Ans = df.columns[5]
Ans

In [ ]:
# 6. 6번째 컬럼의 데이터 타입 확인
Ans = df.iloc[:,5].dtype
Ans

In [ ]:
# 7. 데이터 셋의 인덱스 구성
Ans = df.index
Ans

In [ ]:
# 8. 6번째 컬럼의 3번째 값은 무엇인가
Ans = int(df['firstBlood'][2])
Ans

In [ ]:
# iloc 익숙해지기 !!
Ans2 = int(df.iloc[2,5])
Ans2

In [ ]:
# 9.컬럼명이 한글인 데이터 불러오기
# df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/Jeju.csv', encoding='utf-8')
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/Jeju.csv', encoding='cp949')
df.info()

In [ ]:
# 10. 데이터 마지막 3개행 출력
# Ans = df.iloc[-3:,:] 
# 이거도 가능하지만 마지막이니까 tail 활용해서 간단히 출력 가능함
Ans = df.tail(3)
Ans

In [ ]:
# 11. 수치형 변수를 가진 컬럼 출력
# df.info()
Ans = df.select_dtypes(exclude='object').columns
Ans

In [ ]:
# 12. 범주형 변수를 가진 컬럼 출력
Ans = df.select_dtypes(include='object').columns
Ans

In [ ]:
# 13. 각 컬럼의 결측치 수 파악
# df.info()

Ans = df.isnull().sum()
Ans

In [ ]:
# 14. 각 컬럼의 데이터 수, 데이터 타입 한번에 확인
df.info()

In [ ]:
# 15. 각 수치형 변수의 분포 확인
# print(dir(pd))
Ans = df.describe()
Ans

In [ ]:
# 16. 거주인구 컬럼 값 출력
Ans = df['거주인구']
Ans

In [ ]:
# 17. '평균 속도' 컬럼의 4분위 범위 (IQR) 값 구하기
Ans = print(df['평균 속도'].quantile(0.75) - df['평균 속도'].quantile(0.25))

In [ ]:
# 18. '읍면동명' 컬럼의 유일값 수 찾기
Ans = len(df['읍면동명'].unique())
Ans

In [ ]:
# 19. '읍면동명' 컬럼 유일값 모두 출력
Ans = df['읍면동명'].unique()
Ans

## 02 Filtering & Sorting

In [ ]:
# 20. 데이터 로드
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/chipo.csv')
df.info()

In [ ]:
# 21. quantity 컬럼 값이 3인 데이터 5행 출력
Ans = df[df['quantity']==3].head()
Ans

In [ ]:
# 22. quantity 컬럼 값이 3인 데이터를 추출하고 index를 0부터 정렬 후 첫 5행 출력
# Ans = dir(df[df['quantity']==3].reset_index())
# Ans = (df[df['quantity']==3].reset_index()).head(5)
Ans = (df[df['quantity']==3].reset_index(drop=True)).head(5)
Ans

In [ ]:
# 23. quantity, item_price 두 컬럼으로 구성된 새로운 dataframe 정의
Ans = df[['quantity', 'item_price']]
Ans

### 250611

In [ ]:
# 24. item_price 컬럼의 달러 표시 제거 후 float 타입으로 new_price 컬럼에 저장

df['new_price'] = df['item_price'].str[1:].astype('float')
Ans = df['new_price'].head()
Ans

In [ ]:
# 25. new_price 컬럼에서 5 이하의 값을 가지는 데이터 프레임을 추출하고 전체 갯수 
Ans = len(df[df['new_price'] <= 5])
Ans

In [ ]:
# 26. item_name 명이 Chicken Salad Bowl 인 데이터를 추출 후 index 값을 초기화 하여 출력
Ans = df[df['item_name']=='Chicken Salad Bowl'].reset_index(drop=True)
Ans.head(3)

In [ ]:
# 27. new_price 가 9 이하이고 item_name이 Chicken Salad Bowl인 데이터 출력
Ans = df[(df['new_price'] <= 9) & (df['item_name'] == 'Chicken Salad Bowl')]
Ans

In [ ]:
# 28. new_price 컬럼 값에 따라 오름차순 정리 후 index 초기화 하여 출력
# Ans = dir(df[df['new_price']])
Ans = df.sort_values(by='new_price').reset_index(drop=True)
Ans.head(4)

In [ ]:
# 29. item_name 값 중 Chips 가 포함되는 데이터 출력

## 행 값을 기준으로 문자열 포함 확인 시 .str.contains() 활용

Ans = df[df['item_name'].str.contains('Chips')]
Ans.head(5)

In [ ]:
# 30. 짝수번째 컬럼의 데이터만 출력
Ans = df.iloc[:,::2]
Ans

In [ ]:
# 31. new_price 기준 내림차순 정렬 후 index 초기화 출력
Ans = df.sort_values('new_price', ascending=False).reset_index(drop=True)
Ans

In [ ]:
# 32. item_name 값이 Steak Salad 또는 Bowl 인 데이터 출력
Ans = df[(df['item_name']=='Steak Salad') | (df['item_name']=='Bowl')]
Ans

In [ ]:
# 33. item_name 컬럼 값이 Steak Salad 또는 Bowl 인 데이터를 데이터 프레임화 한 후, 
# item_name를 기준으로 중복행이 있으면 제거하되 첫번째 케이스 남겨서 출력

# 중복 제거시  drop_duplicates() 활용

Ans = df[(df['item_name']=='Steak Salad') | (df['item_name']=='Bowl')]
Ans = Ans.drop_duplicates('item_name')
Ans

In [ ]:
# 33. item_name 컬럼 값이 Steak Salad 또는 Bowl 인 데이터를 데이터 프레임화 한 후, 
# item_name를 기준으로 중복행이 있으면 제거하되 마지막 케이스 남겨서 출력

Ans = df[(df['item_name']=='Steak Salad') | (df['item_name']=='Bowl')]
Ans = Ans.drop_duplicates('item_name', keep='last')
Ans

In [ ]:
# 35. new_price 값이 new_price 값의 평균값 이상을 가지는 데이터 출력
Ans = df[df['new_price'] >= df['new_price'].mean()]
Ans.head(5)

In [ ]:
# 36. item_name 의 값이 lzze 인 데이터를  Fizzy Lizzy로 수정

# loc[조건, '열'] = '값' -> 조건을 만족하는 특정 열의 값을 변경하는 가장 안전한 방법

Ans = df.loc[df['item_name']=='Izze', 'item_name'] = 'Fizzy Lizzy'
Ans = df
Ans.head(3)

In [ ]:
# 37.choice_description 값이 NaN 인 데이터의 수
Ans = int(df['choice_description'].isnull().sum())
Ans

In [ ]:
# 38. choice_description 값이 NaN 인 데이터의 값을 NoData로 변경
Ans = df.loc[df['choice_description'].isnull(), 'choice_description'] = 'Nodata'
Ans = df
Ans.head()

In [ ]:
# 39. choice_description 값에 Black 이 들어가는 경우 출력

# 행 기준 문자열 포함 확인 시 .str.contains() !!!!!!!!
# 잊 지 마 !!!

Ans = df[df['choice_description'].str.contains('Black')]
Ans.head(5)

In [ ]:
# 40. choice_description 값에 Vegetables 들어가지 않는 경우의 갯수 출력
# Ans = int(df['choice_description'].count() - df.choice_description.str.contains('Vegetables', na=False).sum())
Ans = len(df.loc[~df['choice_description'].str.contains('Vegetables', na=False)])
Ans

In [ ]:
# 41. item_name 값이 N으로 시작하는 데이터 모두 출력

# 포함하는 단어 df['컬럼'].str.contains('단어')
# 시작하는 단어 df['컬럼'].str.startswith('단어')
Ans = df[df['item_name'].str.startswith('N')]
Ans.head(3)

In [ ]:
# 42. item_name 값의 길이가 15 이상인 데이터 출력

# 단어의 길이 df['컬럼'].str.len()
Ans = df[df['item_name'].str.len() >= 15]
Ans.head(3)

In [ ]:
lst = [1.69, 2.39, 3.39, 4.45, 9.25, 10.98, 11.75, 16.98]

# list 안에 포함되는지 확인할 때 .isin()

Ans = df.loc[df['new_price'].isin(lst)]

# 데이터프레임을 출력할 때 display()
display(Ans.head(3))
print(len(Ans))

# 03 Grouping

In [ ]:
# 44. 데이터 로드 후 상위 5개 출력
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/AB_NYC_2019.csv')
df.head(5)

In [ ]:
# 45. 데이터 각 host_name 빈도수를 구하고 host_name 기준 정렬 후 상위 5개 출력
Ans = df.groupby('host_name').size()
Ans.head(5)

In [ ]:
# 46. host_name 빈도수를 구하고 빈도수 기준 내림차순 정렬 후 데이터 프레임 생성
# 빈도수 컬럼 명은 counts 로 설정

Ans = df.groupby('host_name').size().reset_index()
Ans.columns = ['host_name', 'counts']
Ans = Ans.sort_values(by='counts', ascending=False)
Ans.head(5)

### 250612

In [ ]:
# 47. neighbourhood_group 의 값에 따른 neighbourhood 컬럼 값의 갯수 구하기
Ans = df.groupby(['neighbourhood_group', 'neighbourhood']).size().reset_index()
Ans.head(4)

In [ ]:
# 48. neighbourhood_group 의 값에 따른 neighbourhood 컬럼 값 중 neighbourhood_group의 최대 값
Ans = df.groupby(['neighbourhood_group', 'neighbourhood']).size().reset_index()
Ans = Ans.groupby(['neighbourhood_group']).max().reset_index()
Ans

In [ ]:
# 49. neighbourhood_group 값에 따른 price 값의 평균, 분산, 최대, 최소값 구하기
Ans = df[['neighbourhood_group','price']].groupby('neighbourhood_group').agg(['mean', 'var', 'max', 'min'])
Ans

In [ ]:
# 50. neighbourhood_group 값에 따른 reviews_per_month 평균, 분산, 최대, 최소 값 구하기
Ans = df[['neighbourhood_group','reviews_per_month']].groupby('neighbourhood_group').agg(['mean', 'var', 'max', 'min'])
Ans

In [ ]:
# 51. neighbourhood 값과 neighbourhood_group 값에 따른 price 평균
# Ans = df[['neighbourhood','neighbourhood_group', 'price']].groupby(['neighbourhood', 'neighbourhood_group']).agg(['mean'])

Ans = df.groupby(['neighbourhood', 'neighbourhood_group']).price.mean()
Ans

In [ ]:
# 52. neighbourhood 값과 neighbourhood_group 값에 따른 price 평균을 계층적 indexing 없이 출력

# 계층적으로 출력 .unstack()
Ans = df.groupby(['neighbourhood', 'neighbourhood_group']).price.mean().unstack()
Ans

In [ ]:
# 53. neighbourhood 값과 neighbourhood_group 값에 따른 price 평균을 계층적 indexing 없이 구하고
# NaN 을 -999 로 채우기

# NaN 값 채우기 .fillna()

Ans = df.groupby(['neighbourhood', 'neighbourhood_group']).price.mean().unstack().fillna(-999)
Ans.head(4)

In [ ]:
# 54. neighbourhood_group 값이 Queens값을 가지는 데이터들 중 neighbourhood 그룹별로
#     price값의 평균, 분산, 최대, 최소값

Ans = df[df.neighbourhood_group=='Queens'].groupby(['neighbourhood']).price.agg(['mean', 'var', 'max', 'min'])
Ans.head(4)

In [ ]:
# 55. neighbourhood_group 값에 따른 room_type 컬럼의 수를 구하고
# neighbourhood_group 값을 기준으로 각 값의 비율 구하기

# 방 수 
room = df.groupby(['neighbourhood_group', 'room_type']).size().unstack()

# 방 비율
room_ratio = room.div(room.sum(axis=1), axis=0)

room_ratio

# 04 Apply, Map

In [ ]:
# 56. 데이터 로드 행/열 갯수 확인
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv')

Ans = df.shape
Ans

In [ ]:
df['Income_Category']

In [ ]:
# 57. Income_Category의 카테고리를 map 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑
dic = {
    'Unknown'        : 'N',
    'Less than $40K' : 'a',
    '$40K - $60K'    : 'b',
    '$60K - $80K'    : 'c',
    '$80K - $120K'   : 'd',
    '$120K +'        : 'e'   
}

df['newIncome'] = df.Income_Category.map(lambda x: dic[x])
Ans = df['newIncome']

Ans.head(4)

In [ ]:
# 58. 상동

def changeCategory(x):
    if x == 'Unknown':
        return 'N'
    elif x == 'Less than $40K':
        return 'a'
    elif x == '$40K - $60K':
        return 'b'
    elif x == '$60K - $80K':
        return 'c'
    elif x == '$80K - $120K':
        return 'd'
    elif x == '$120K +':
        return 'e'

df['newIncome'] = df.Income_Category.apply(changeCategory)

Ans = df['newIncome']
Ans.head(4)

In [ ]:
# 59. Customer_Age의 값을 이용해 나이 구간을 AgeState 컬럼으로 정의

def AgeState(x):
    if 0 <= x <= 9:
        return '0'
    elif 10 <= x <= 19:
        return '10'
    elif 20 <= x <= 29:
        return '20'
    elif 30 <= x <= 39:
        return '30'
    elif 40 <= x <= 49:
        return '40'
    elif 50 <= x <= 59:
        return '50'
    elif 60 <= x <= 69:
        return '60'
    elif 70 <= x <= 79:
        return '70'

df['AgeState'] = df.Customer_Age.apply(AgeState)
Ans = df.groupby('AgeState').size()

Ans

### 250615

In [ ]:
# 60. Education_Level 값 중 Graduate 단어가 포함 된 경우는 1, 아닌경우 0으로 변경 후 newEduLevel 컬럼에 빈도수 출력
def EducationLevel(x):
    if 'Graduate' in x:
        return 1
    else:
        return 0

df['newEduLevel'] = df.Education_Level.apply(EducationLevel)
Ans = df.groupby('newEduLevel').size()

Ans

In [ ]:
# 61. Credit_Limit 값이 4500 이상이면 1 아니면 0 newLimit 작성 후 빈도수 출력
def checkLimit(x):
    if x >= 4500:
        return 1
    else:
        return 0

df['newLimit'] = df.Credit_Limit.apply(checkLimit)
Ans = df.groupby('newLimit').size()

Ans

In [ ]:
# 62. Marital_Status 가 Married 이고 Card_Category 가 Platinum 이면 1 아니면 0
def check(x):
    if x.Marital_Status == 'Married' and x.Card_Category == 'Platinum':
        return 1
    else:
        return 0

df['newState'] = df.apply(check, axis = 1)
Ans = df.groupby('newState').size()

Ans

In [ ]:
# 63. Gender 가 M 이면 male F 면 female
def check(x):
    if x == 'M':
        return 'male'
    elif x == 'F':
        return 'female'

df['Gender'] = df.Gender.apply(check)
Ans = df.groupby('Gender').size()

Ans

# 05 Time Series

In [ ]:
# 64. 데이터 불러와서 정보 출력
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/timeTest.csv')
df.info()

In [ ]:
# 65. Yr_Mo_Dy를 pandas가 인식 가능한 datetime 타입으로 수정
df.Yr_Mo_Dy = pd.to_datetime(df.Yr_Mo_Dy)
Ans = df.Yr_Mo_Dy
Ans.head(4)

In [ ]:
# 66. Yr_Mo_Dy 에 존재하는 년도의 유일값 모두 출력

# dt.[year(년), month(월), day(일), weekday(요일)] 
Year = df.Yr_Mo_Dy.dt.year.unique()
Month = df.Yr_Mo_Dy.dt.month.unique()
Day = df.Yr_Mo_Dy.dt.day.unique()
Weekday = df.Yr_Mo_Dy.dt.weekday.unique()
print(Year)
print(Month)
print(Day)
print(Weekday)

In [ ]:
# 67. 년도가 2061 이상이면 -100 해서 재설정
def check(x):
    if x.year >= 2061:
        return x.replace(year = x.year - 100)
    else:
        return x
df['Yr_Mo_Dy'] = df['Yr_Mo_Dy'].apply(check)

Ans = df.head(4)
Ans

In [ ]:
# 68. 년도 별 각 컬럼의 평균 구하기
Ans = df.groupby(df.Yr_Mo_Dy.dt.year).mean(numeric_only=True)
Ans.head(4)

In [ ]:
# 69. weekday 컬럼 만들고 요일별로 매핑
df['weekday'] = df.Yr_Mo_Dy.dt.weekday
Ans = df['weekday'].head(4).to_frame()
Ans

In [ ]:
# 70. 주말이면 1 평일이면 0
def check(x):
    if x < 5:
        return 0
    else:
        return 1

df['WeekCheck'] = df.weekday.apply(check)
Ans = df['WeekCheck'].head(3).to_frame()
Ans

In [ ]:
# 71. 전체 년의 각 달 평균
Ans = df.groupby(df.Yr_Mo_Dy.dt.month).mean(numeric_only=True)
Ans.head(4)

In [ ]:
# 72. 결측치 직전값으로 대체, 첫번째 행이 결측치일 경우 뒤의 값으로 대체
df = df.ffill().bfill()
df.isnull().sum()

In [ ]:
# 73. 년도 - 월 기준 모든 컬럼의 평균 구하기
#.dt.to_period('M') 사용
Ans = df.groupby(df['Yr_Mo_Dy'].dt.to_period('M')).mean(numeric_only=True)
Ans.head(3)

In [ ]:
# 74. RPT 컬럼을 일자별 기준 1차 차분
Ans = df['RPT'].diff()

Ans.head(3)

In [ ]:
# 75. RPT, VAL 일주일 간격으로 이동평균한 값 구하기

# rolling(window = n) window 만큼 이동,
Ans = df[['RPT', 'VAL']].rolling(window=7).mean()
Ans.head(9)

In [ ]:
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/seoul_pm.csv')
df.info()

In [ ]:
# # 76. (년-월-일:시)를 datetime으로 변경 서울시의 제공데이터의 경우 0시가 24시로 표현된다
# from datetime import timedelta

# def change_date(x):
#     x = str(x)
#     date = x.split(':')[0]
#     hour = x.split(':')[1]

#     if hour == '24':
#         hour = '00:00:00'

#         Finaldate = pd.to_datetime(date + " " + hour) + timedelta(days=1)

#     else:
#         hour = hour + ':00:00'
#         Finaldate = pd.to_datetime(date + " " + hour)

#     return Finaldate

# df['(년-월-일:시)'] = df['(년-월-일:시)'].apply(change_date)
# Ans = df
# Ans

# def change_date(x):
#     import datetime
#     hour = x.split(':')[1]
#     date = x.split(':')[0]
    
#     if hour =='24':
#         hour ='00:00:00'
        
#         FinalDate = pd.to_datetime(date +" "+hour) +datetime.timedelta(days=1)
        
#     else:
#         hour = hour +':00:00'
#         FinalDate = pd.to_datetime(date +" "+hour)
    
#     return FinalDate

# df['(년-월-일:시)'] = df['(년-월-일:시)'].apply(change_date)

# Ans = df

def changeDate(x):
  import datetime
  date = x.split(':')[0]
  hour = x.split(':')[1]

  if hour == '24':
    hour = '00:00:00'

    FinalDate = pd.to_datetime(date+" "+hour) + datetime.timedelta(days=1)
    # 24시 이면 다음날 date에 +1 하고 00시로 바꿈
  else:
    hour = hour + ':00:00'
    FinalDate = pd.to_datetime(date+" "+hour)
  return FinalDate

df['(년-월-일:시)'] = df['(년-월-일:시)'].apply(changeDate)
df.head()

In [ ]:
# 77. 일자별 영어요일 이름을 dayName 컬럼에 저장
df['dayName'] = df['(년-월-일:시)'].dt.day_name()
Ans = df['dayName']
Ans.head(5)

In [ ]:
# 78. 일자별 각 PM10 등급의 빈도수 파악
Ans = df.groupby(['dayName', 'PM10등급'], as_index=False).size()
Ans2 = df.groupby(['dayName', 'PM10등급']).size().unstack(fill_value=0)
Ans.head()

In [ ]:
Ans2

In [ ]:
# 79. 시간이 연속적으로 존재하며 결측치가 없는지 확인
# 시간을 차분했을 경우 첫 값은 nan, 이후 모든 차분값이 동일하면 연속이라 판단한다.
check = len(df['(년-월-일:시)'].diff().unique())
if check == 2:
    Ans = True
else:
    Ans = False

Ans

In [ ]:
# 80. 오전 10시와 오후 10시의 PM 10의 평균
Ans = df.groupby(df['(년-월-일:시)'].dt.hour)['PM10'].mean()
Ans = Ans.loc[[10, 22]].to_frame()
Ans

In [ ]:
# 81. 날짜 컬럼을 index로 만들기
df = df.set_index('(년-월-일:시)')
df

In [ ]:
# 82. 데이터 주 단위로 뽑고 최소, 최대, 평균, 표준편차 구하기

Ans = df.select_dtypes(exclude='object').resample('W').agg(['min','max','mean','std'])

Ans.head(5)

# 06 Pivot

In [104]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/under5MortalityRate.csv')

In [105]:
df.head(4)

,Location,Period,Indicator,Dim1,First Tooltip
0,Afghanistan,2019,Under-five mortality rate (probability of dyin...,Both sexes,60.27 [47.44-74.62]
1,Afghanistan,2019,Under-five mortality rate (probability of dyin...,Male,63.83 [50.04-79.16]
2,Afghanistan,2019,Under-five mortality rate (probability of dyin...,Female,56.57 [44.54-70.18]
3,Afghanistan,2018,Under-five mortality rate (probability of dyin...,Both sexes,62.54 [50.64-75.41]

In [106]:
# 83. Indicator을 삭제하고 First Tooltip 컬럼에서 신뢰구간에 해당하는 표현을 지우기 
df = df.drop(columns='Indicator')

def setTool(x):
    x = x.split('[')[0].strip()
    return float(x)

df['First Tooltip']= df['First Tooltip'].apply(setTool)

Ans = df

# df.drop('Indicator',axis=1,inplace=True)

# df['First Tooltip'] = df['First Tooltip'].map(lambda x: float(x.split("[")[0]))

# Ans = df

In [107]:
# Ans = df
Ans.head(4)

      Location  Period        Dim1  First Tooltip
0  Afghanistan    2019  Both sexes          60.27
1  Afghanistan    2019        Male          63.83
2  Afghanistan    2019      Female          56.57
3  Afghanistan    2018  Both sexes          62.54

In [108]:
# 84. 년도가 2015 이상 dim1 == Both sexes 인 데이터만 출력
dfdf = df[(df.Dim1 == 'Both sexes') & (df.Period >= 2015)]
Ans = dfdf

# target = df[(df.Period >=2015) & (df.Dim1 =='Both sexes')]
# Ans = target
Ans.head(3)

      Location  Period        Dim1  First Tooltip
0  Afghanistan    2019  Both sexes          60.27
3  Afghanistan    2018  Both sexes          62.54
6  Afghanistan    2017  Both sexes          64.94

In [109]:
# 85. 84번 문제에서 추출한 데이터로 나라에 따른 년도별 사망률 데이터를 프레임화
Ans = dfdf.pivot(index='Location', columns='Period', values='First Tooltip')
# Ans = target.pivot(index='Location',columns='Period',values='First Tooltip')
Ans.head(3)

Period        2015   2016   2017   2018   2019
Location
Afghanistan  70.44  67.57  64.94  62.54  60.27
Albania       9.57   9.42   9.42   9.53   9.68
Algeria      25.18  24.79  24.32  23.81  23.26

In [111]:
# 86. Dim1에 따른 년도별 사망비율의 평균
# 중복을 평균으로 집계하여 해결
Ans = df.pivot_table(index='Dim1', columns='Period', values='First Tooltip', aggfunc='mean')
# 
# Ans = df.pivot_table(index='Dim1',columns='Period',values='First Tooltip',aggfunc='mean')
Ans.iloc[:, :4]

Period            1950        1951        1952        1953
Dim1
Both sexes  147.700816  155.537544  157.811094  156.147206
Female      140.909796  149.210175  151.516094  150.250882
Male        154.151224  161.538246  163.760781  161.742059

In [112]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/winter.csv')

In [133]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5770 entries, 0 to 5769
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        5770 non-null   int64
 1   City        5770 non-null   object
 2   Sport       5770 non-null   object
 3   Discipline  5770 non-null   object
 4   Athlete     5770 non-null   object
 5   Country     5770 non-null   object
 6   Gender      5770 non-null   object
 7   Event       5770 non-null   object
 8   Medal       5770 non-null   object
dtypes: int64(1), object(8)
memory usage: 405.8+ KB

In [134]:
# 87. 데이터에서 한국 KOR 데이터만 추출
Ans = df[df['Country'] == 'KOR']
Ans.head(4)

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
2652,1992,Albertville,Skating,Short Track Speed Skating,"LEE, Jun-Ho",KOR,Men,1000M,Bronze
2653,1992,Albertville,Skating,Short Track Speed Skating,"KIM, Ki-Hoon",KOR,Men,1000M,Gold
2671,1992,Albertville,Skating,Short Track Speed Skating,"KIM, Ki-Hoon",KOR,Men,5000M Relay,Gold
2672,1992,Albertville,Skating,Short Track Speed Skating,"LEE, Jun-Ho",KOR,Men,5000M Relay,Gold

In [135]:
# 88. 한국 올림픽 메달리스트 데이터에서 년도에 따른 medal 갯수를 데이터프레임
Ans = Ans.pivot_table(index='Year', columns='Medal', aggfunc='size').fillna(0)
Ans

Medal  Bronze  Gold  Silver
Year
1992      1.0   5.0     1.0
1994      1.0   8.0     1.0
1998      2.0   6.0     4.0
2002      0.0   5.0     2.0
2006      2.0  14.0     3.0
2010      2.0   6.0    10.0
2014      2.0   7.0     5.0

In [136]:
# 89. 전체 데이터에서 sport종류에 따른 성별수를 구하여라
Ans = df.pivot_table(index='Sport', columns='Gender', aggfunc='size')
Ans

Gender       Men  Women
Sport
Biathlon     270    150
Bobsleigh    416     36
Curling       97     75
Ice Hockey  1231    305
Luge         135     45
Skating      665    564
Skiing      1130    651

In [138]:
# 90. 전체 데이터에서 Discipline종류에 따른 따른 Medal수를 구하여라
Ans = df.pivot_table(index='Discipline', columns='Medal', aggfunc='size')
Ans

Medal                      Bronze  Gold  Silver
Discipline
Alpine Skiing                 141   143     144
Biathlon                      139   140     141
Bobsleigh                     147   134     141
Cross Country Skiing          263   264     262
Curling                        56    58      58
Figure skating                118   122     119
Freestyle Skiing               34    34      34
Ice Hockey                    512   510     514
Luge                           60    62      58
Nordic Combined                55    55      55
Short Track Speed Skating      96    97      97
Skeleton                       10    10      10
Ski Jumping                    68    69      70
Snowboard                      30    30      30
Speed skating                 190   193     197

# 07 Merge, Concat

In [226]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/mergeTEst.csv',index_col= 0)

In [227]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Afghanistan to Austria
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   2010    10 non-null     float64
 1   2011    10 non-null     float64
 2   2012    10 non-null     float64
 3   2013    10 non-null     float64
 4   2014    10 non-null     float64
 5   2015    10 non-null     float64
 6   2016    10 non-null     float64
 7   2017    10 non-null     float64
 8   2018    10 non-null     float64
 9   2019    10 non-null     float64
dtypes: float64(10)
memory usage: 880.0+ bytes

In [228]:
df1 = df.iloc[:4,:]
df2 = df.iloc[4:,:]

In [229]:
# 91. df1과 df2 데이터를 하나의 데이터 프레임으로 합쳐라
df = pd.concat([df1, df2])

In [230]:
df

,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Location,,,,,,,,,,
Afghanistan,64.023,61.640,59.367,57.170,55.080,53.107,51.267,49.560,47.983,46.453
Albania,11.803,10.807,9.943,9.267,8.790,8.493,8.363,8.363,8.453,8.597
Algeria,23.540,22.907,22.450,22.117,21.850,21.587,21.257,20.850,20.407,19.930
Andorra,4.240,4.033,3.843,3.667,3.490,3.330,3.187,3.060,2.933,2.827
Angola,75.713,71.280,67.233,63.570,60.430,57.757,55.510,53.460,51.757,50.093
Antigua and Barbuda,8.667,8.223,7.807,7.420,7.070,6.757,6.483,6.230,6.000,5.783
Argentina,12.887,12.380,11.840,11.283,10.733,10.203,9.683,9.177,8.680,8.227
Armenia,16.497,15.677,14.897,14.170,13.477,12.817,12.183,11.583,11.007,10.497
Australia,3.993,3.803,3.623,3.467,3.343,3.253,3.183,3.137,3.090,3.047
Austria,3.573,3.463,3.333,3.210,3.113,3.043,2.987,2.943,2.897,2.843

In [231]:
df3 = df.iloc[:2,:4]
df4 = df.iloc[5:,3:]

display(df3)
display(df4)

               2010    2011    2012    2013
Location
Afghanistan  64.023  61.640  59.367  57.170
Albania      11.803  10.807   9.943   9.267

                       2013    2014    2015    2016    2017    2018    2019
Location
Antigua and Barbuda   7.420   7.070   6.757   6.483   6.230   6.000   5.783
Argentina            11.283  10.733  10.203   9.683   9.177   8.680   8.227
Armenia              14.170  13.477  12.817  12.183  11.583  11.007  10.497
Australia             3.467   3.343   3.253   3.183   3.137   3.090   3.047
Austria               3.210   3.113   3.043   2.987   2.943   2.897   2.843

In [232]:
# 92. df3과 df4 데이터를 하나의 데이터 프레임으로 합쳐라. 둘다 포함하고 있는 년도에 대해서만 고려한다

Ans = pd.concat([df3, df4], join='inner')
Ans

                       2013
Location
Afghanistan          57.170
Albania               9.267
Antigua and Barbuda   7.420
Argentina            11.283
Armenia              14.170
Australia             3.467
Austria               3.210

In [233]:
# 93. df3과 df4 데이터를 하나의 데이터 프레임으로 합쳐라. 모든 컬럼을 포함하고, 결측치는 0으로 대체한다
Ans = pd.concat([df3, df4], join='outer').fillna(0)
Ans

,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Location,,,,,,,,,,
Afghanistan,64.023,61.640,59.367,57.170,0.000,0.000,0.000,0.000,0.000,0.000
Albania,11.803,10.807,9.943,9.267,0.000,0.000,0.000,0.000,0.000,0.000
Antigua and Barbuda,0.000,0.000,0.000,7.420,7.070,6.757,6.483,6.230,6.000,5.783
Argentina,0.000,0.000,0.000,11.283,10.733,10.203,9.683,9.177,8.680,8.227
Armenia,0.000,0.000,0.000,14.170,13.477,12.817,12.183,11.583,11.007,10.497
Australia,0.000,0.000,0.000,3.467,3.343,3.253,3.183,3.137,3.090,3.047
Austria,0.000,0.000,0.000,3.210,3.113,3.043,2.987,2.943,2.897,2.843

In [234]:
df5 = df.T.iloc[:7,:3]
df6 = df.T.iloc[6:,2:5]

display(df5)
display(df6)

Location  Afghanistan  Albania  Algeria
2010           64.023   11.803   23.540
2011           61.640   10.807   22.907
2012           59.367    9.943   22.450
2013           57.170    9.267   22.117
2014           55.080    8.790   21.850
2015           53.107    8.493   21.587
2016           51.267    8.363   21.257

Location  Algeria  Andorra  Angola
2016       21.257    3.187  55.510
2017       20.850    3.060  53.460
2018       20.407    2.933  51.757
2019       19.930    2.827  50.093

In [247]:
# 94. df5과 df6 데이터를 하나의 데이터 프레임으로 merge함수를 이용하여 합쳐라. Algeria컬럼을 key로 하고 두 데이터 모두 포함하는 데이터만 출력하라

Ans = df5.merge(df6, how='inner', on='Algeria')
Ans

Location  Afghanistan  Albania  Algeria  Andorra  Angola
0              51.267    8.363   21.257    3.187   55.51

In [246]:
# 95. df5과 df6 데이터를 하나의 데이터 프레임으로 merge함수를 이용하여 합쳐라. Algeria컬럼을 key로 하고 합집합으로 합쳐라
Ans = pd.merge(df5, df6, how='outer')
Ans

Location  Afghanistan  Albania  Algeria  Andorra  Angola
0                 NaN      NaN   19.930    2.827  50.093
1                 NaN      NaN   20.407    2.933  51.757
2                 NaN      NaN   20.850    3.060  53.460
3              51.267    8.363   21.257    3.187  55.510
4              53.107    8.493   21.587      NaN     NaN
5              55.080    8.790   21.850      NaN     NaN
6              57.170    9.267   22.117      NaN     NaN
7              59.367    9.943   22.450      NaN     NaN
8              61.640   10.807   22.907      NaN     NaN
9              64.023   11.803   23.540      NaN     NaN